src_ext/InformationRegisters/УЗ_ЖурналРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УЗ_ЖурналРассылки</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Адреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_СтатусыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_Урок</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ученик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_КаналыСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/Enums/УЗ_ВидыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>УЗ_ВидыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Задолженность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Занятие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеАбонемента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вручную</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_ext/Enums/УЗ_КаналыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>УЗ_КаналыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Почта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телеграм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WhatsApp</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_ext/Enums/УЗ_СтатусыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>УЗ_СтатусыСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Песочница</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_ext/Catalogs/УЗ_ФизЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УЗ_ФизЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Фото</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Http</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповеститьПоEmail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповеститьПоSMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповеститьПоТелефону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаПедагога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтавкиПедагогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Родитель1Прежний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Comment>Составной тип: пустое значение (Неопределено) — пол не указан; Булево пустым не бывает</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Статусы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заметки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоВыбранныеГруппыОбучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПедагог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выбыл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредпочитаемыйКанал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_КаналыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСогласия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтписки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Плательщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Плательщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КемПриходится</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_ЖурналРассылки/Ext/ManagerModule.bsl
//Журнал сообщений (до 2.2 — «Журнал писем о задолженности»): каждая попытка отправить сообщение ученику или
//плательщику — вид (задолженность, занятие, окончание абонемента, вручную), канал (почта, Telegram, SMS, WhatsApp),
//получатель, статус и ошибка (В46). Для задолженности — одна история ручной рассылки должникам и регламентного
//оповещения о долге (УЗ_Сервер.ПроверкаЗадолженности, В27): письмо ученику в организации не повторяется чаще N
//дней, кто бы его ни отправил. Напоминания о занятии и абонементе по нему не повторяются (УЗ_Сообщения).
//Менеджер журнал только читает: пишет код — обычной записью у руководителя, иначе в привилегированном режиме
//(вне безопасного режима; в безопасном режиме почта и так не уходит).

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//Ключ ученика и организации в соответствиях последних писем.
Функция КлючПисьма(Ученик, Организация) Экспорт

	Возврат Строка(Ученик.УникальныйИдентификатор()) + "|"
		+ ?(ЗначениеЗаполнено(Организация), Строка(Организация.УникальныйИдентификатор()), "");

КонецФункции

//Последние ОТПРАВЛЕННЫЕ сообщения о долге (любым каналом; записи до 2.2 — без вида,
//это письма о долге): Соответствие КлючПисьма → дата письма.
//  Ученики — массив или Неопределено (все).
Функция ПоследниеПисьма(Ученики = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Журнал.Ученик КАК Ученик,
	|	Журнал.Организация КАК Организация,
	|	МАКСИМУМ(Журнал.Период) КАК Дата
	|ИЗ
	|	РегистрСведений.УЗ_ЖурналРассылки КАК Журнал
	|ГДЕ
	|	Журнал.Отправлено
	|	И Журнал.Вид В (ЗНАЧЕНИЕ(Перечисление.УЗ_ВидыСообщений.Задолженность),
	|		ЗНАЧЕНИЕ(Перечисление.УЗ_ВидыСообщений.ПустаяСсылка))
	|	И (&ВсеУченики
	|			ИЛИ Журнал.Ученик В (&Ученики))
	|
	|СГРУППИРОВАТЬ ПО
	|	Журнал.Ученик,
	|	Журнал.Организация";
	Запрос.УстановитьПараметр("ВсеУченики", Ученики = Неопределено);
	Запрос.УстановитьПараметр("Ученики", ?(Ученики = Неопределено, Новый Массив, Ученики));
	Итог = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Итог.Вставить(КлючПисьма(Выборка.Ученик, Выборка.Организация), Выборка.Дата);
	КонецЦикла;
	Возврат Итог;

КонецФункции

//Записать попытку письма о задолженности (почта; до 2.2 — единственный вид). Ошибка записи журнала не отменяет
//отправленного письма — она в журнале регистрации.
//  Вручную — Истина: рассылка должникам (с пользователем), Ложь — регламентное оповещение.
//Возврат: дата записи (Период) или пустая дата, если записать не удалось.
Функция ЗаписатьПисьмо(Ученик, Организация, Сумма, Адреса, Отправлено, ТекстОшибки, Вручную) Экспорт

	Запись = НоваяЗапись();
	Запись.Ученик = Ученик;
	Запись.Организация = Организация;
	Запись.Сумма = Сумма;
	Запись.Адреса = ?(ТипЗнч(Адреса) = Тип("Массив"), СтрСоединить(Адреса, "; "), Строка(Адреса));
	Запись.Отправлено = Отправлено;
	Запись.ТекстОшибки = ТекстОшибки;
	Запись.Вручную = Вручную;
	Запись.Вид = Перечисления.УЗ_ВидыСообщений.Задолженность;
	Запись.Канал = Перечисления.УЗ_КаналыСообщений.Почта;
	Запись.Статус = ?(Отправлено, Перечисления.УЗ_СтатусыСообщений.Отправлено, Перечисления.УЗ_СтатусыСообщений.Ошибка);
	Возврат ЗаписатьСообщение(Запись);

КонецФункции

//Пустая запись журнала для ЗаписатьСообщение: Структура по измерениям, ресурсам и реквизитам регистра.
Функция НоваяЗапись() Экспорт

	Возврат Новый Структура("Ученик, Организация, Получатель, Канал, Сумма, Отправлено, Адреса, ТекстОшибки, Вручную,
		|Вид, Статус, Источник, Текст", Справочники.УЗ_ФизЛица.ПустаяСсылка(), Справочники.Организации.ПустаяСсылка(),
		Справочники.УЗ_ФизЛица.ПустаяСсылка(), Перечисления.УЗ_КаналыСообщений.ПустаяСсылка(), 0, Ложь, "", "", Ложь,
		Перечисления.УЗ_ВидыСообщений.ПустаяСсылка(), Перечисления.УЗ_СтатусыСообщений.ПустаяСсылка(), Неопределено,
			"");

КонецФункции

//Записать попытку сообщения (Запись — см. НоваяЗапись). Ошибка записи журнала не отменяет отправленного сообщения —
//она в журнале регистрации. Пишет код отправки: у руководителя обычной записью, у менеджера — привилегированно
//(вне безопасного режима; в безопасном режиме сообщения и так не уходят).
//Возврат: дата записи (Период) или пустая дата, если записать не удалось.
Функция ЗаписатьСообщение(Данные) Экспорт

	Период = ТекущаяДатаСеанса();
	Привилегированно = Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.УЗ_ЖурналРассылки);
	Попытка
		Если Привилегированно Тогда
			УстановитьПривилегированныйРежим(Истина);
		КонецЕсли;
		//два сообщения одному получателю в одну секунду (повтор после
		//ошибки, два занятия) — следующая свободная секунда
		Для Сдвиг = 0 По 59 Цикл
			Проба = СоздатьМенеджерЗаписи();
			Проба.Период = Период;
			Проба.Ученик = Данные.Ученик;
			Проба.Организация = Данные.Организация;
			Проба.Получатель = Данные.Получатель;
			Проба.Канал = Данные.Канал;
			Проба.Прочитать();
			Если Не Проба.Выбран() Тогда
				Прервать;
			КонецЕсли;
			Период = Период + 1;
		КонецЦикла;
		Запись = СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Данные,
			"Ученик, Организация, Получатель, Канал, Сумма, Отправлено, Вручную, Вид,
			|Статус, Источник");
		Запись.Период = Период;
		Запись.Адреса = Лев(Данные.Адреса, 255);
		Запись.ТекстОшибки = Лев(Данные.ТекстОшибки, 1000);
		Запись.Текст = Лев(Данные.Текст, 1000);
		Если Данные.Вручную Тогда
			Запись.Пользователь = УЗ_Среда.ТекущийПользователь();
		КонецЕсли;
		Запись.Записать();
		Если Привилегированно Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
	Исключение
		Если Привилегированно И ПривилегированныйРежим() Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Учёт занятий.Сообщения'"), УровеньЖурналаРегистрации.Ошибка, ,
			Данные.Ученик,
			НСтр("ru = 'Не записан журнал сообщений:'") + " " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат '00010101';
	КонецПопытки;
	Возврат Период;

КонецФункции

#КонецЕсли
